## Infrastructure Pipeline Results

### Stage 1: Terraform Validation
✅ **Format Check**: Passed
✅ **Terraform Init**: Passed
✅ **Terraform Validate**: Passed

### Stage 2: Security Scan
✅ **Checkov Scan**: Completed (check Security tab for details)

### Stage 3: Terraform Plan
✅ **Plan Status**: Succeeded

<details>
<summary>📋 Show Plan Output</summary>

```terraform
To view this run in a browser, visit:
https://app.terraform.io/app/Kolayemi-org/muykol-chatbot-dev/runs/run-pYe8TaKqazjtFRPa

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_vpc_endpoint.interface_endpoints["sqs"] will be created
  + resource "aws_vpc_endpoint" "interface_endpoints" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "*"
                      + Condition = {
                          + StringEquals = {
                              + "aws:PrincipalVpc" = "vpc-0f29bd551135a3a65"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-0004ae59d1e806adf",
        ]
      + service_name          = "com.amazonaws.us-east-1.sqs"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-0b6d1c2c4ed6c1deb",
        ]
      + tags                  = {
          + "Name" = "muykol-chatbot-sqs-endpoint"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform-cloud"
          + "Name"        = "muykol-chatbot-sqs-endpoint"
          + "Project"     = "muykol-chatbot"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0f29bd551135a3a65"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Run status: planned and saved (confirmable)
Workspace is unlocked

```

</details>

---

**Next Steps:**
- Review the plan output above
- Check security scan results in the Security tab
- If everything looks good, approve and merge this PR
- Terraform Apply will run automatically after merge
